const { generateWAMessageFromContent, proto } = (await import('@whiskeysockets/baileys')).default

var handler = async (m, { conn, text }) => {

    conn.reply(m.chat, `『✧』 ${pickRandom(global.consejo)}`,
    m,
    { 
        contextInfo: { 
            externalAdReply: {
                title: '•🍀 اقتباس / نصيحة 🍀•',
                body: dev, // يمكنك تعديل dev إلى اسمك أو بوتك
                sourceUrl: channel, // رابط قناتك
                thumbnail: icons // صورة مصغرة
            }
        }
    })
}

handler.help = ['نصيحة']
handler.tags = ['ترفيه']
handler.command = ['نصيحة', 'consejo', 'اقتباس']
handler.fail = null
handler.exp = 0

export default handler

let hasil = Math.floor(Math.random() * 5000)
function pickRandom(list) {
    return list[Math.floor(list.length * Math.random())]
}

// =========================================================
// ********** 💡 قائمة النصائح والإقتباسات المُعربة 💡 **********
// =========================================================
global.consejo = [
    "تذكر أنك لا يمكنك أن تفشل في أن تكون نفسك (وين داير)",
    "دائماً من المبكر جداً أن تستسلم (خورخي ألفاريز كاماتشو)",
    "شيء واحد فقط يجعل الحلم مستحيلاً: الخوف من الفشل (باولو كويلو)",
    "ما تفعله اليوم قد يحسن كل أيامك القادمة (رالف مارستون)",
    "الأفعال الصغيرة كل يوم تصنع أو تهدم الشخصية (أوسكار وايلد)",
    "اسقط سبع مرات وانهض ثماني مرات (مثل ياباني)",
    "لكي يكون للتغييرات قيمة حقيقية، يجب أن تكون متسقة ودائمة (أنتوني روبنز)",
    "لا يحدث شيء حتى يتحرك شيء ما (ألبرت أينشتاين)",
    "أن تكون خاسراً جيداً هو أن تتعلم كيف تفوز (كارل ساندبرج)",
    "كل أحلامنا يمكن أن تتحقق، إذا كانت لدينا الشجاعة لملاحقتها (والت ديزني)",
    "من يغير نفسه، يغير العالم (الدالاي لاما)",
    "وقتك محدود، فلا تضيعه في عيش حياة شخص آخر... امتلك الشجاعة لاتباع قلبك وحدسك (ستيف جوبز)",
    "معظم الناس يضيعون وقتاً وطاقة أكبر في الحديث عن المشكلات بدلاً من مواجهتها (هنري فورد)",
    "ليس الأمر أن لدينا القليل من الوقت، بل إننا نضيع الكثير منه (سينيكا)",
    "لتنجح، يجب أن تكون رغبتك في النجاح أكبر من خوفك من الفشل (بيل كوسبي)",
    "الباحث الحقيقي ينمو ويتعلم، ويكتشف أنه دائماً المسؤول الرئيسي عما يحدث (خورخي بوكاي)",
    "إذا لم تقرع الفرصة بابك، فابنِ لها باباً (ميلتون بيرل)",
    "هناك دائماً طريقة أفضل للقيام بالأمر، اعثر عليها (توماس أديسون)",
    "لم يفت الأوان أبداً لتكون الشخص الذي كان يمكن أن تكونه (جورج إليوت)",
    "عندما لا نعود قادرين على تغيير وضع ما، فإننا نتحدى أن نغير أنفسنا (فيكتور فرانكل)",
    "الهزيمة ليست هزيمة حتى يتم قبولها كحقيقة في عقلك (بروس لي)",
    "من الصعب أن تفشل، ولكن الأسوأ هو ألا تحاول النجاح أبداً (ثيودور روزفلت)",
    "السعادة مخبأة في غرفة انتظار السعادة (إدوارد بونيت)",
    "الثقة بالنفس هي أول سر للنجاح (رالف والدو إيمرسون)",
    "الرجل المستعد جيداً للمعركة قد حقق بالفعل نصف النصر (ميغيل دي سرفانتس)",
    "نحن نعرف ما نحن عليه، لكننا لا نعرف ما يمكن أن نكونه (ويليام شكسبير)",
    "تبدأ الحياة في نهاية منطقة الراحة (نيل دونالد والش)",
    "أي شخص لا يرتكب أخطاء فإنه لا يحاول بما فيه الكفاية (ويس روبرتس)",
    "يجب أن تفعل الأشياء التي تعتقد أنك لا تستطيع فعلها (إليانور روزفلت)",
    "الثقة بنفسك لا تضمن النجاح، لكن عدم الثقة يضمن الفشل (ألبرت باندورا)",
    "أكبر خطأ يمكن أن يرتكبه شخص هو الخوف من ارتكاب خطأ (إلبرت هوبارد)",
    "من بذرة صغيرة يمكن أن تنمو جذع قوي (إسخيلوس)",
    "الطريقة الوحيدة للعثور على حدود الممكن هي تجاوز المستحيل (آرثر سي كلارك)",
    "عندما تقدم لك الحياة ليمونة، اعصرها واصنع منها عصير ليمون (كليمنت ستون)",
    "مقياس ما نحن عليه هو ما نفعله بما لدينا (فينس لومباردي)",
    "نصبح ما نفكر فيه (إيرل نايتنغال)",
    "وحدهم أولئك الذين يتجرأون على ارتكاب إخفاقات كبيرة هم من ينتهي بهم الأمر إلى تحقيق نجاحات كبيرة (روبرت ف. كينيدي)",
    "قوة الخيال تجعلنا لا نهائيين (جون موير)",
    "أولاً وقبل كل شيء، الاستعداد هو مفتاح النجاح (ألكسندر غراهام بيل)",
    "أفضل طريقة للتنبؤ بالمستقبل هي اختراعه (آلان كاي)",
    "الأشياء لا تُقال، بل تُفعل، لأنها عندما تُفعل، فإنها تقول نفسها (وودي آلن)",
    "أعطها النور وسيختفي الظلام من تلقاء نفسه (إراسموس)",
    "لزيادة تقديرنا لذاتنا، يجب أن نتعلم أولاً كيف نعيش بوعي، لأن هذا هو أساسنا لكل شيء (ناثانيل براندن)",
    "المشكلة هي أنك تعتقد أن لديك وقتاً (بوذا)",
    "الشخص صاحب الفكرة الجديدة يكون موضع سخرية حتى تنجح الفكرة (مارك توين)",
    "إذا كنت ترغب حقاً في رؤية الخالق، فكن أنت صانعاً (ديباك شوبرا)",
    "لا تتقدم الحياة بالاحتفال بالنجاحات بل بتجاوز الإخفاقات (أوريسون سويت ماردن)",
    "الخوف قد يشل، ويسيطر، ويعزل، ولكن أمام لمحة من الشجاعة، سيتراجع بسرعة (خوسيه أنطونيو مارينا)",
    "النجاح ليس عشوائياً. إنه متغير تابع للجهد (سوفوكليس)",
    "يحتاج الإنسان إلى الصعوبات لأنها ضرورية للاستمتاع بالنجاح (أ.ب.ج. عبد الكلام)",
    "اجعل إدراكك لكل ما يجعلك تشعر بالرضا أكثر حدة واستمتع به (مارتن سيليغمان)",
    "لا تيأس. غالباً ما يكون المفتاح الأخير الذي تركته لتجربه هو الذي يفتح القفل. (مجهول)",
    "الحياة التي لم يتم فحصها لا تستحق العيش (سقراط)",
    "كل شيء هو نمو وتعلم، نمو مستمر (برايان ويس)",
    "أنا دائماً أفعل أشياء لا أعرف كيف أفعلها، لذلك يجب أن أتعلم كيف أفعلها (بابلو بيكاسو)",
    "القائد هو شخص يعرف الطريق، يسلكه، ويظهره للآخرين (جون سي. ماكسويل)",
    "كل النجاحات ناتجة عن العمل والمعرفة والمثابرة (أوج ماندينو)",
    "عندما يكون الظلام حالكاً، يمكنك رؤية النجوم (مثل فارسي)",
    "أكبر متعة في الحياة هي فعل ما يقول الناس إنك لا تستطيع فعله (والتر باجيت)",
    "النجاح هو الحصول على ما تريد. السعادة هي أن تريد ما حصلت عليه بالفعل (لاير ريبيرو)",
    "يمكنك أن تفعل أي شيء ولكن لا يمكنك أن تفعل كل شيء (ديفيد ألين)",
    "أنا فقط أستطيع تغيير حياتي. لا أحد يستطيع أن يفعل ذلك من أجلي (كارول بيرنيت)",
    "تسعون بالمائة من جميع الذين يفشلون، لم يُهزموا حقاً؛ لقد استسلموا ببساطة (بول ج. ماير)",
    "يبدو الأمر دائماً مستحيلاً... حتى يتم إنجازه (نيلسون مانديلا)",
    "كل إنسان يموت. ليس كل إنسان يعيش (ويليام والاس)",
    "لا يجب الخوف من أي شيء في الحياة، بل يجب فهمه فقط. حان الوقت لنفهم أكثر ونخاف أقل (ماري كوري)",
    "نحن ما نفعله مراراً وتكراراً. التميز، إذن، ليس فعلاً بل عادة (أرسطو)",
    "الحياة ليست مشكلة يجب حلها، بل حقيقة يجب اختبارها (سورين كيركغارد)",
    "لا يمكن التقدم إلا عندما ننظر إلى الأمام. لا يمكن التطور إلا عندما نفكر بشكل كبير (أورتيغا إي غاسيت)",
    "النصر أحلى عندما تكون قد عرفت الهزيمة بالفعل (مالكولم فوربس)",
    "ما لا يقتلك يجعلك أقوى (فريدريك نيتشه)",
    "وحدهم أولئك الذين يجرؤون على المعاناة من الإخفاقات الكبرى هم القادرون على تحقيق نجاحات كبيرة (ويل سميث)",
    "رائد الأعمال الحقيقي هو فاعل، وليس حالم (نولان بوشنل)",
    "عليك تدريب عقلك ليكون إيجابياً تماماً كما تدرب جسمك (شون آكور)",
    "القوة والنمو لا يأتيان إلا من خلال الجهد والنضال المستمرين (نابليون هيل)",
    "هناك في الخارج، في مرآب ما، رجل أعمال يصنع رصاصة باسم شركتك (جاري هامل)",
    "عندما يكون لديك حلم، عليك أن تمسكه ولا تدعه يذهب أبداً (كارول بيرنيت)",
    "انظر عن كثب إلى الحاضر الذي تبنيه، يجب أن يشبه المستقبل الذي تحلم به (أليس ووكر)",
    "لا تنجو الأنواع الأقوى، ولا الأذكى، بل تلك التي تتكيف بشكل أفضل مع التغيير (داروين)",
    "كلما فعلنا أكثر، زادت قدرتنا على الفعل (ويليام هازليت)",
    "الحياة ليست عن إيجاد نفسك. الحياة عن خلق نفسك (جورج برنارد شو)",
    "الحظ هو عائد الجهد. كلما تعرقت أكثر، زاد حظك (راي كروك)",
    "الطريقة الأكثر فعالية للقيام بذلك هي القيام به (أميليا إيرهارت)",
    "معنى الحياة هو إعطاء الحياة معنى (كين هادجينز)",
    "مفتاح النجاح: الرغبة في الفوز، ومعرفة كيفية الخسارة (نيكولا مكيافيلي)",
    "لا يمكنك هزيمة الشخص الذي لا يستسلم أبداً (بابي روث)",
    "الحلم هو مجرد حلم. الهدف هو حلم مع خطة وموعد نهائي (هارفي ماكاي)",
    "النجاح قرار. قرر ما ستفعله بحياتك أو سيقوم شخص آخر بذلك نيابة عنك (جون أتكينسون)",
    "عليك أن تجعله يحدث (دينيس ديدرو)",
    "الحياة مسرحية لا تسمح بالتدريب... لذا، غنّ، اضحك، ارقص، ابكِ، وعش كل لحظة من حياتك بشدة... قبل أن ينزل الستار وتنتهي المسرحية بدون تصفيق (تشارلي شابلن)",
    "إذا أخطأت، فالذنب ليس ذنب والديك أو أساتذتك، لذا لا تتباكى على أخطائك وتعلم منها (بيل غيتس)",
    "أنا لا أهرب من التحدي لأني خائفة. بل على العكس، أركض نحو التحدي لأن الطريقة الوحيدة للهروب من الخوف هي سحقه بقدميك (نادية كومانشي)",
    "الخطة الجيدة غير الكاملة التي يتم تنفيذها اليوم أفضل من الخطة المثالية التي يتم تنفيذها غداً (الجنرال باتون)",
    "التصميم هو نقطة البداية لكل إنجاز (دبليو. كليمنت ستون)",
    "ما لا يبدأ لن يكون له نهاية أبداً (يوهان فولفغانغ فون غوته)",
    "اختر وظيفة تحبها، ولن تضطر إلى العمل مرة أخرى في حياتك (كونفوشيوس)",
    "أكبر خطر هو عدم تحمل أي مخاطر (مارك زوكربيرج)",
    "يمكنني قبول الفشل، الجميع يفشل في شيء ما. لكن لا يمكنني قبول عدم المحاولة (مايكل جوردان)",
    "أحد أكبر الأخطاء التي يرتكبها الناس هو محاولة إجبار أنفسهم على الاهتمام بشيء ما. أنت لا تختار شغفك؛ شغفك يختارك (جيف بيزوس)",
    "افعل، أو لا تفعل، ولكن لا تحاول (يودا)",
    "السلاح الرئيسي لكي تصبح الدولة قوة عظمى هو التعليم (هاش جوتا)",
    "كن على طبيعتك. كل الآخرين مشغولون بالفعل (أوسكار وايلد)",
    "كن أفضل نسخة من نفسك (مجهول)"
]