var handler = async (m, { conn, command, text, usedPrefix }) => {

    // التحقق من المدخلات
    if (!text) return conn.reply(m.chat, `🚩 *أدخل اسم أي شخص للتحليل*\n\nمثال: ${usedPrefix + command} تنغن ملك المهرجانات`, m);

    // بناء رسالة التحليل العشوائي
    let personalidad = `
*👑 تحليل شخصية ${text} 👑*
━𑇍⸢🍁⸥𑇍━

*🔸 الاسم* : ${text}
*🔸 الأخلاق الحميدة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','96%','99%','0%','4%'])}
*🔸 الأخلاق السيئة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','96%','99%','0%','4%'])}
*🔸 نوع الشخصية* : ${pickRandom(['طيب القلب','متكبر','بخيل','كريم','متواضع','خجول','جبان','متطفل','متفائل','انطوائي', 'ساخر', 'غامض', 'عاطفي'])}
*🔸 غالباً ما يكون* : ${pickRandom(['منزعجاً','شارد الذهن','كثير الثرثرة','يشتري أشياء','يشاهد الأنمي','على الإنترنت','كسولاً لا يفعل شيئاً','يبحث عن الإثارة','يخطط للمهرجانات','يمارس الرياضة','يشرب القهوة'])}
*🔸 الذكاء* : ${pickRandom(['9%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','96%','99%','0%','4%'])}
*🔸 الشجاعة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','96%','99%','0%','4%'])}
*🔸 الخوف* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','96%','99%','0%','4%'])}
*🔸 الشهرة* : ${pickRandom(['6%','12%','20%','27%','35%','41%','49%','54%','60%','66%','73%','78%','84%','92%','96%','99%','0%','4%'])}
*🔸 الصفة الاجتماعية* : ${pickRandom(['رجل / ذكر', 'امرأة / أنثى', 'ودود جداً', 'متحفظ', 'قائد', 'تابع', 'مرح', 'جاد'])}
*🔸 تنبؤ البوت:* ${pickRandom(['قد يكون ملك المهرجانات القادم!','لا يمكن التنبؤ به أبداً.','شخصيته تتبدل كالفصول.','يبدو أنه يحتاج إلى المزيد من النوم.','إنه شخص فريد من نوعه!'])}

*🎮 بوت كيرا تنغن*
`.trim()

    conn.reply(m.chat, personalidad, m)
}

handler.help = ['شخصية *<الاسم>*']
handler.tags = ['ترفيه']
handler.command = ['شخصية', 'تحليل', 'اوصف']

handler.register = true

export default handler

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)]
}