const handler = async (m, { conn, text}) => {
m.reply(`*📜 تنغن كيرا 🍁*\n\n🕌 *حديث شريف:*\n\n"${pickRandom(global.piropo)}"`)
}
handler.tags = ['احاديث']
handler.command = ['حديث','احاديث']
export default handler
    
function pickRandom(list) {
return list[Math.floor(list.length * Math.random())]}
    
global.piropo = [
"لَمَّا خَلَقَ اللَّهُ الخَلْقَ، كَتَبَ في كِتَابِهِ، فَهو عِنْدَهُ فَوْقَ العَرْشِ: إنَّ رَحْمَتي تَغْلِبُ غَضَبِي.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"لَمَّا قَضَى اللَّهُ الخَلْقَ، كَتَبَ في كِتَابِهِ علَى نَفْسِهِ، فَهو مَوْضُوعٌ عِنْدَهُ إنَّ رَحْمَتي تَغْلِبُ غَضَبِي.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"قالَ اللَّهُ عَزَّ وَجَلَّ: سَبَقَتْ رَحْمَتي غَضَبِي.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"إذا أمَّ أحَدُكُمُ النَّاسَ، فَلْيُخَفِّفْ، فإنَّ فِيهِمُ الصَّغِيرَ، والْكَبِيرَ، والضَّعِيفَ، والْمَرِيضَ، فإذا صَلَّى وحْدَهُ فَلْيُصَلِّ كيفَ شاءَ.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"يَا مَعْشَرَ الشَّبَابِ، مَنِ اسْتَطَاعَ مِنْكُمُ البَاءَةَ فَلْيَتَزَوَّجْ، فإنَّه أَغَضُّ لِلْبَصَرِ، وَأَحْصَنُ لِلْفَرْجِ، وَمَن لَمْ يَسْتَطِعْ فَعليه بالصَّوْمِ، فإنَّه له وِجَاءٌ.\n\n- الراوي: عبدالله بن مسعود\n- حكم الحديث: [صحيح]",
"مَن أَحَبَّ لِقَاءَ اللهِ، أَحَبَّ اللَّهُ لِقَاءَهُ، وَمَن كَرِهَ لِقَاءَ اللهِ، كَرِهَ اللَّهُ لِقَاءَهُ.\n\n- الراوي: عبادة بن الصامت\n- حكم الحديث: [صحيح]",
"غَدْوَةٌ، أوْ رَوْحَةٌ في سَبيلِ اللهِ، خَيْرٌ مِنَ الدُّنْيا وما فيها.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"إنَّ في الجُمُعَةِ لَساعَةً، لا يُوافِقُها مُسْلِمٌ، قائِمٌ يُصَلِّي، يَسْأَلُ اللَّهَ خَيْرًا، إلَّا أعْطاهُ إيَّاهُ.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"مَن حَمَلَ عليْنا السِّلاحَ فليسَ مِنَّا.\n\n- الراوي: عبدالله بن عمر\n- حكم الحديث: [صحيح]",
"السَّفَرُ قِطْعَةٌ مِنَ العَذابِ، يَمْنَعُ أحَدَكُمْ نَوْمَهُ وطَعامَهُ وشَرابَهُ، فإذا قَضَى أحَدُكُمْ نَهْمَتَهُ مِن وجْهِهِ، فَلْيُعَجِّلْ إلى أهْلِهِ.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"إنَّ العَبْدَ، إذا وُضِعَ في قَبْرِهِ، وتَوَلَّى عنْه أصْحابُهُ، إنَّه لَيَسْمَعُ قَرْعَ نِعالِهِمْ.\n\n- الراوي: أنس بن مالك\n- حكم الحديث: [صحيح]",
"مُرَّ بجَنَازَةٍ فَأُثْنِيَ عَلَيْهَا خَيْرًا، فَقالَ نَبِيُّ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ: وَجَبَتْ، وَجَبَتْ، وَجَبَتْ.\n\n- الراوي: أنس بن مالك\n- حكم الحديث: [صحيح]",
"لا يُجْلَدُ أحَدٌ فَوْقَ عَشَرَةِ أسْواطٍ، إلَّا في حَدٍّ مِن حُدُودِ اللَّهِ.\n\n- الراوي: هانئ بن نيار أبو بردة\n- حكم الحديث: [صحيح]",
"مَن رَأَى مِن أمِيرِهِ شيئًا يَكْرَهُهُ فَلْيَصْبِرْ، فإنَّه مَن فارَقَ الجَماعَةَ شِبْرًا، فَماتَ، فَمِيتَةٌ جاهِلِيَّةٌ.\n\n- الراوي: عبدالله بن عباس\n- حكم الحديث: [صحيح]",
"خَيْرُ نِساءٍ رَكِبْنَ الإبِلَ، صالِحُ نِساءِ قُرَيْشٍ أحْناهُ علَى ولَدٍ في صِغَرِهِ، وأَرْعاهُ علَى زَوْجٍ في ذاتِ يَدِهِ.\n\n- الراوي: أبو هريرة\n- حكم الحديث: [صحيح]",
"أَخَذَ عَلَيْنَا رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ مع البَيْعَةِ، أَلَّا نَنُوحَ.\n\n- الراوي: أم عطية نسيبة بنت كعب\n- حكم الحديث: [صحيح]",
"إنَّ اللَّهَ عَزَّ وَجَلَّ قدْ وَكَّلَ بالرَّحِمِ مَلَكًا، فيَقولُ: أَيْ رَبِّ نُطْفَةٌ، أَيْ رَبِّ عَلَقَةٌ، أَيْ رَبِّ مُضْغَةٌ.\n\n- الراوي: أنس بن مالك\n- حكم الحديث: [صحيح]",
"اجْتَمع نِسَاءُ النبيِّ صَلَّى اللَّهُ عليه وَسَلَّمَ، فَلَمْ يُغَادِرْ منهنَّ امْرَأَةً، فَجَاءَتْ فَاطِمَةُ تَمْشِي كَأنَّ مِشْيَتَهَا مِشْيَةُ رَسُولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ.\n\n- الراوي: عائشة أم المؤمنين\n- حكم الحديث: [صحيح]",
"أنَّ أَهْلَ الجَاهِلِيَّةِ كَانُوا يَصُومُونَ يَومَ عَاشُورَاءَ، وَأنَّ رَسولَ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ صَامَهُ، وَالْمُسْلِمُونَ قَبْلَ أَنْ يُفْتَرَضَ رَمَضَانُ.\n\n- الراوي: عبدالله بن عمر\n- حكم الحديث: [صحيح]",
"كَانَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ يَأْمُرُ بصِيَامِهِ قَبْلَ أَنْ يُفْرَضَ رَمَضَانُ، فَلَمَّا فُرِضَ رَمَضَانُ، كانَ مَن شَاءَ صَامَ يَومَ عَاشُورَاءَ وَمَن شَاءَ أَفْطَرَ.\n\n- الراوي: عائشة أم المؤمنين\n- حكم الحديث: [صحيح]"
]