const handler = async (m, {conn, text}) => {
  m.reply(`*📜 تنغن كيرا 🍁*\n\n💫 *حكمة اليوم:*\n\n"${pickRandom(global.hekma)}"`);
};
handler.tags = ['frasss'];
handler.command = ['حكمه','حكمة'];
export default handler;

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())];
}

global.hekma = [
  'اقبل كل التغيرات في حياتك ولا تقبل ان يتغير عليك احد.',
  'لا مزيد من التعلم. المعرفة هي أداة قوية',
  'أن العناية بصحتك الجسدية والعقلية هي أساسيات لحياة كاملة.',
  'استمتع بالأشياء الصغيرة، يمكنها ان تصبح كبيرة في يوم من الايام.',
  'احصل على التسامح، حتى تتمكن من الحصول على نفس الشيء، لتحرير قلبك.',
  'قيمة الوقت الذي تقضيه مع شغفك هو الهدية الأكثر قيمة',
  'كن ودودًا ورحيمًا مع الناس، فكل عمل طيب يمكنه أن يحدث فرقًا',
  'اتخذ قرارًا بـ لا عندما تحتاج إلى ذلك، وحدد حدودًا جديرة بالثناء.',
  'لا تقارن نفسك بالآخرين، كل شخص لديه طريقته الخاصة في الحياة.',
  'استمع إلى الآخرين بالتعاطف والفهم، فالتواصل هو أساس العلاقات القوية.',
  'حاول التعبير عن مشاعرك، الصدق ضروري في الحب.',
  'تعلم العطاء والتسوية، الحب يتطلب التضحية والبذل المتبادل',
  'ان تخلي عنك الكل فلا تيأس انت الأفضل',
  'كل شخص لديه ميزة خارقة اجتهد لتعرف ميزتك',
  'قم باختيار الخيارات الصعبة فهي دائما الأفضل.',
  'تذكر أن العلاقة مبنية على الثقة المتبادلة والاحترام',
  'اختر شخصًا يكملك وسيكون إصدارًا أفضل لنفسك',
  'الحب الحقيقي لن يصبح أقل، بل سيصبح أكثر.',
  'العمار هو فعل، هو اختيار يومي يتم زراعته بالأفعال والأقوال.',
  'إذا كنت استباقيًا وتأخذ المبادرة في عملك، فهذا سيكون ذا قيمة',
  'اعترف بأخطائك وإخفاقاتك، وستكون لديك فرص للنمو وتحسينها.',
  'واجب عليك الصلاة اليومية لتستطيع تحقيق أحلامك لأن الله قادر على كل شيء.',
  'ابنِ علاقات جيدة مع زملائك، فالعمل في الفريق ضروري لتحقيق النجاح',
  'لا تجهد نفسك في البحث عن المساعدة، دائمًا ما يكون هناك شيء جديد تتعلمه',
  'تعرف على إنجازاتك وقيمتها، واحتفل بنجاحاتك',
  'ابحث عن التوازن بين حياتك المهنية والشخصية'
];